# 다양한 출력 포멧

# 빈자리는 빈공간을 두고, 오른쪽 정렬을 하되, 총 10자리 공간을 확보.
print("{0:.>10}".format(500))

print("==========================================")
# 양수일 때는 +로 표시, 음수일때는 - 표시
print("{0: >+10}".format(500))
print("{0: >+10}".format(-500))

print("==========================================")
# 왼쪽 정렬하고 , 빈칸으로 _로 채운다.
print("{0:_<+10}".format(400))

print("==========================================")
# 3자리마다 콤마찍기.
print("{0:,}".format(100000000000))

print("==========================================")
# 3자리마다 콤마찍기. + - 부호
print("{0:+,}".format(100000000000))

print("==========================================")
# 3자리마다 콤마를 찍어주기, 부호도 붙이고, 자릿수 확보하기.
# 돈이 많은면 빈칸 ^로 채우기
print("{0:^<+30,}".format(100000000000))

print("==========================================")
# 소수점
print("{0:f}".format(5/3))

# 소수점 특정 자리수 (소수점 2)
print("{0:.2f}".format(5/3))